package day0616;

// Class
// Java 에서의 프로그램 하나하나를 뜻함.
// 지금까지 만든 프로그램은 3세대 객체지향적 언어의 관점에서는 클래스라고 부를 수 없었다.
// 그 이유는, 클래스는 반드시 데이터를 저장할 공간과 해당 클래스 변수들이
// 실행할 수 있는 기능이 같이 정의되어있어야 했지만
// 우리는 지금까지 둘 중 하나만 정의해왔기 때문이다.

// 프로그램을 기능의 집합이라고 생각했던 2세대 절차지향적 언어와 다르게
// 3세대 객체지향적 언어에서는 프로그램을 더 작은 프로그램 변수의 집합으로 본다.

// 즉 학생과 관련된 프로그램을 만들게 될때
// 학생과 관련한 클래스를 만들어서 그 안에
// 해당 클래스 변수, 즉
// 1. 어떠한 정보를 가질지
// 2. 그 객체들이 실행시킬 메소드를 정의하고,
// 필요할 때 마다 그 객체들을 만들어서 사용하게 된다.

// 클래스의 구성
// 필드 + 메소드

// 필드 : 해당 클래스의 객체들이 가지고 있을 데이터들의 종류
// 메소드 : 해당 클래스의 객체들이 실행가능한 기능들

public class Ex01Class {
}
