package day0609;

public class Ex01Naming {
    // java's nameing Rule
    // 공통규칙
    // 1. 모든 이름은 대소문자가 엄격하게 구분된다.
    // 2. 이름의 중간이나 맨 끝에는 숫자가 들어갈 수 있지만,
    // 숫자로 이름을 시작할 수 없다.
    // 3. _를 제외한 모든 특수문자는 사용할 수 없다.
    // 4. 자바에서는 내부적으로 기능이 정의되어있는 50가지의
    // 키워드가 존재한다. 해당 키워드로는 이름을 만들 수 없으므로 외워야 한다.

    // 낙타등표기법(캐멀표기법)과 뱀표기법
    // 낙타등 : 단어구분을 위해 두번째 단어부터는 대문자로 표기
    // 뱀 : 단어구분을 위해 단어 사이에 _를 넣어주는 표기법

    // 각종 개념에 대한 명명법
    // 1. 패키지 : 내부에 포함된 클래스들의 성격을 나타내는 한 단어
    // 소문자로 시작
    // 2. 클래스 : 대문자로 시작하고 낙타등 표기법을 사용하는 명사.
    // 3. 메소드 : 소문자로 시작하고 낙타등 표기법을 사용하는 동사.
    // 4. 변수 : 소문자로 시작하고 낙타등 표기법을 사용하는 명사.
    // 5. 상수 : 뱀 표기법을 사용하는 명사. -- final을 이용해서 변하지 않는 값으로 선언 가능함.

    // 데이터타입 - 기본형 참조형
    // 기본형 데이터타입 : int, byte, etc...
    // 참조형 데이터타입 : 배열, 클래스, 인터페이스


}